---
permalink: s3-config/create-intercluster-lifs-remote-fabricpool-tiering-task.html 
sidebar: sidebar 
keywords: create, intercluster, lifs, remote fabricpool, tiering 
summary: ONTAP S3を使用してリモートのFabricPool容量（クラウド）階層化を有効にする場合、クラスタ間LIFを設定する必要があります。データ ネットワークと共有するポートにクラスタ間LIFを設定できます。これにより、クラスタ間ネットワークに必要なポート数を減らすことができます。 
---
= ONTAP S3を使用したリモートFabricPool階層化用のクラスタ間LIFを作成する
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
ONTAP S3を使用してリモートのFabricPool容量（クラウド）階層化を有効にする場合、クラスタ間LIFを設定する必要があります。データ ネットワークと共有するポートにクラスタ間LIFを設定できます。これにより、クラスタ間ネットワークに必要なポート数を減らすことができます。

.開始する前に
* 基盤となる物理または論理ネットワーク ポートが管理 `up`ステータスに設定されている必要があります。link:https://docs.netapp.com/us-en/ontap-cli/up.html["ONTAPコマンド リファレンス"^]の `up`の詳細を確認してください。
* LIFサービス ポリシーがすでに存在している必要があります。


.タスク概要
ローカルのFabricPool階層化や外部のS3アプリにはクラスタ間LIFは必要ありません。

.手順
. クラスタ内のポートの一覧を表示します。
+
`network port show`

+
次の例は、 `cluster01`のネットワーク ポートを示しています：

+
[listing]
----

cluster01::> network port show
                                                             Speed (Mbps)
Node   Port      IPspace      Broadcast Domain Link   MTU    Admin/Oper
------ --------- ------------ ---------------- ----- ------- ------------
cluster01-01
       e0a       Cluster      Cluster          up     1500   auto/1000
       e0b       Cluster      Cluster          up     1500   auto/1000
       e0c       Default      Default          up     1500   auto/1000
       e0d       Default      Default          up     1500   auto/1000
cluster01-02
       e0a       Cluster      Cluster          up     1500   auto/1000
       e0b       Cluster      Cluster          up     1500   auto/1000
       e0c       Default      Default          up     1500   auto/1000
       e0d       Default      Default          up     1500   auto/1000
----
+
 `network port show`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-port-show.html["ONTAPコマンド リファレンス"^]を参照してください。

. システムSVMにクラスタ間LIFを作成します。
+
`network interface create -vserver Cluster -lif _LIF_name_ -service-policy default-intercluster -home-node _node_ -home-port _port_ -address _port_IP_ -netmask _netmask_`

+
次の例では、クラスタ間 LIF `cluster01_icl01`と `cluster01_icl02`を作成します：

+
[listing]
----

cluster01::> network interface create -vserver Cluster -lif cluster01_icl01 -service-
policy default-intercluster -home-node cluster01-01 -home-port e0c -address 192.168.1.201
-netmask 255.255.255.0

cluster01::> network interface create -vserver Cluster -lif cluster01_icl02 -service-
policy default-intercluster -home-node cluster01-02 -home-port e0c -address 192.168.1.202
-netmask 255.255.255.0
----
+
 `network interface create`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-interface-create.html["ONTAPコマンド リファレンス"^]を参照してください。

. クラスタ間LIFが作成されたことを確認します。
+
`network interface show -service-policy default-intercluster`

+
[listing]
----
cluster01::> network interface show -service-policy default-intercluster
            Logical    Status     Network            Current       Current Is
Vserver     Interface  Admin/Oper Address/Mask       Node          Port    Home
----------- ---------- ---------- ------------------ ------------- ------- ----
cluster01
            cluster01_icl01
                       up/up      192.168.1.201/24   cluster01-01  e0c     true
            cluster01_icl02
                       up/up      192.168.1.202/24   cluster01-02  e0c     true
----
. クラスタ間LIFが冗長構成になっていることを確認します。
+
`network interface show -service-policy default-intercluster -failover`

+
次の例は、 `e0c`ポート上のクラスタ間LIF `cluster01_icl01`および `cluster01_icl02`が `e0d`ポートにフェイルオーバーすることを示しています。

+
[listing]
----
cluster01::> network interface show -service-policy default-intercluster -failover
         Logical         Home                  Failover        Failover
Vserver  Interface       Node:Port             Policy          Group
-------- --------------- --------------------- --------------- --------
cluster01
         cluster01_icl01 cluster01-01:e0c   local-only      192.168.1.201/24
                            Failover Targets: cluster01-01:e0c,
                                              cluster01-01:e0d
         cluster01_icl02 cluster01-02:e0c   local-only      192.168.1.201/24
                            Failover Targets: cluster01-02:e0c,
                                              cluster01-02:e0d
----
+
 `network interface show`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-interface-show.html["ONTAPコマンド リファレンス"^]を参照してください。


