---
permalink: peering/configure-intercluster-lifs-use-ports-own-networks-task.html 
sidebar: sidebar 
keywords: configure, intercluster, LIFs  custom, ipspaces 
summary: カスタムIPspaceにクラスタ間LIFを設定できます。これにより、マルチテナント環境でレプリケーション トラフィックを分離できます。 
---
= カスタムIPspaceでONTAPクラスタ間LIFを設定する
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
カスタムIPspaceにクラスタ間LIFを設定できます。これにより、マルチテナント環境でレプリケーション トラフィックを分離できます。

カスタムIPspaceを作成すると、システムによってシステムストレージ仮想マシン（SVM）が作成され、そのIPspace内のシステムオブジェクトのコンテナとして機能します。この新しいSVMは、新しいIPspace内の任意のクラスタ間LIFのコンテナとして使用できます。新しいSVMの名前は、カスタムIPspaceと同じになります。

.手順
. クラスタ内のポートの一覧を表示します。
+
`network port show`

+
 `network port show`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-port-show.html["ONTAPコマンド リファレンス"^]を参照してください。

+
次の例は、 `cluster01`のネットワーク ポートを示しています：

+
[listing]
----

cluster01::> network port show
                                                             Speed (Mbps)
Node   Port      IPspace      Broadcast Domain Link   MTU    Admin/Oper
------ --------- ------------ ---------------- ----- ------- ------------
cluster01-01
       e0a       Cluster      Cluster          up     1500   auto/1000
       e0b       Cluster      Cluster          up     1500   auto/1000
       e0c       Default      Default          up     1500   auto/1000
       e0d       Default      Default          up     1500   auto/1000
       e0e       Default      Default          up     1500   auto/1000
       e0f       Default      Default          up     1500   auto/1000
cluster01-02
       e0a       Cluster      Cluster          up     1500   auto/1000
       e0b       Cluster      Cluster          up     1500   auto/1000
       e0c       Default      Default          up     1500   auto/1000
       e0d       Default      Default          up     1500   auto/1000
       e0e       Default      Default          up     1500   auto/1000
       e0f       Default      Default          up     1500   auto/1000
----
. クラスタ上にカスタム IPspace を作成します：
+
`network ipspace create -ipspace _ipspace_`

+
次の例では、カスタム IPspace `ipspace-IC1`を作成します：

+
[listing]
----
cluster01::> network ipspace create -ipspace ipspace-IC1
----
+
 `network ipspace create`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-ipspace-create.html["ONTAPコマンド リファレンス"^]を参照してください。

. クラスタ間通信専用として使用可能なポートを決定します。
+
`network interface show -fields home-port,curr-port`

+
 `network interface show`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-interface-show.html["ONTAPコマンド リファレンス"^]を参照してください。

+
次の例は、ポート `e0e`と `e0f`にLIFが割り当てられていないことを示しています。

+
[listing]
----

cluster01::> network interface show -fields home-port,curr-port
vserver lif                  home-port curr-port
------- -------------------- --------- ---------
Cluster cluster01_clus1   e0a       e0a
Cluster cluster01_clus2   e0b       e0b
Cluster cluster02_clus1   e0a       e0a
Cluster cluster02_clus2   e0b       e0b
cluster01
        cluster_mgmt         e0c       e0c
cluster01
        cluster01-01_mgmt1   e0c       e0c
cluster01
        cluster01-02_mgmt1   e0c       e0c
----
. デフォルトのブロードキャスト ドメインから使用可能なポートを削除します：
+
`network port broadcast-domain remove-ports -broadcast-domain Default -ports ports`

+
1つのポートが同時に複数のブロードキャストドメインに属することはできません。link:https://docs.netapp.com/us-en/ontap-cli/network-port-broadcast-domain-remove-ports.html["ONTAPコマンド リファレンス"^]の `network port broadcast-domain remove-ports`の詳細をご覧ください。

+
次の例では、ポート `e0e`と `e0f`をデフォルトのブロードキャスト ドメインから削除します：

+
[listing]
----
cluster01::> network port broadcast-domain remove-ports -broadcast-domain Default -ports
cluster01-01:e0e,cluster01-01:e0f,cluster01-02:e0e,cluster01-02:e0f
----
. ポートがデフォルトのブロードキャスト ドメインから削除されていることを確認します：
+
`network port show`

+
 `network port show`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-port-show.html["ONTAPコマンド リファレンス"^]を参照してください。

+
次の例は、ポート `e0e`と `e0f`がデフォルトのブロードキャスト ドメインから削除されたことを示しています。

+
[listing]
----
cluster01::> network port show
                                                       Speed (Mbps)
Node   Port    IPspace   Broadcast Domain Link   MTU    Admin/Oper
------ ------- --------- --------------- ----- ------- ------------
cluster01-01
       e0a     Cluster    Cluster          up    9000  auto/1000
       e0b     Cluster    Cluster          up    9000  auto/1000
       e0c     Default    Default          up    1500  auto/1000
       e0d     Default    Default          up    1500  auto/1000
       e0e     Default    -                up    1500  auto/1000
       e0f     Default    -                up    1500  auto/1000
       e0g     Default    Default          up    1500  auto/1000
cluster01-02
       e0a     Cluster    Cluster          up    9000  auto/1000
       e0b     Cluster    Cluster          up    9000  auto/1000
       e0c     Default    Default          up    1500  auto/1000
       e0d     Default    Default          up    1500  auto/1000
       e0e     Default    -                up    1500  auto/1000
       e0f     Default    -                up    1500  auto/1000
       e0g     Default    Default          up    1500  auto/1000
----
. カスタム IPspace にブロードキャスト ドメインを作成します：
+
`network port broadcast-domain create -ipspace _ipspace_ -broadcast-domain _broadcast_domain_ -mtu _MTU_ -ports _ports_`

+
次の例では、IPspace `ipspace-IC1`にブロードキャスト ドメイン `ipspace-IC1-bd`を作成します：

+
[listing]
----
cluster01::> network port broadcast-domain create -ipspace ipspace-IC1 -broadcast-domain
ipspace-IC1-bd -mtu 1500 -ports cluster01-01:e0e,cluster01-01:e0f,
cluster01-02:e0e,cluster01-02:e0f
----
. ブロードキャスト ドメインが作成されたことを確認します：
+
`network port broadcast-domain show`

+
 `network port broadcast-domain show`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-port-broadcast-domain-show.html["ONTAPコマンド リファレンス"^]を参照してください。

+
[listing]
----
cluster01::> network port broadcast-domain show
IPspace Broadcast                                         Update
Name    Domain Name    MTU  Port List                     Status Details
------- ----------- ------  ----------------------------- --------------
Cluster Cluster       9000
                            cluster01-01:e0a              complete
                            cluster01-01:e0b              complete
                            cluster01-02:e0a              complete
                            cluster01-02:e0b              complete
Default Default       1500
                            cluster01-01:e0c              complete
                            cluster01-01:e0d              complete
                            cluster01-01:e0f              complete
                            cluster01-01:e0g              complete
                            cluster01-02:e0c              complete
                            cluster01-02:e0d              complete
                            cluster01-02:e0f              complete
                            cluster01-02:e0g              complete
ipspace-IC1
        ipspace-IC1-bd
                      1500
                            cluster01-01:e0e              complete
                            cluster01-01:e0f              complete
                            cluster01-02:e0e              complete
                            cluster01-02:e0f              complete
----
. システムSVMでクラスタ間LIFを作成し、ブロードキャスト ドメインに割り当てます：
+
|===
| オプション | 概要 


 a| 
*ONTAP 9.6以降：*
 a| 
`network interface create -vserver _system_SVM_ -lif _LIF_name_ -service-policy default-intercluster -home-node _node_ -home-port _port_ -address _port_IP_ -netmask _netmask_`



 a| 
*ONTAP 9.5以前の場合：*
 a| 
`network interface create -vserver _system_SVM_ -lif _LIF_name_ -role intercluster -home-node _node_ -home-port _port_ -address _port_IP_ -netmask _netmask_`

|===
+
LIFは、ホーム ポートが割り当てられているブロードキャスト ドメインに作成されます。ブロードキャスト ドメインには、ブロードキャスト ドメインと同じ名前のデフォルトのフェイルオーバー グループがあります。link:https://docs.netapp.com/us-en/ontap-cli/network-interface-create.html["ONTAPコマンド リファレンス"^]の `network interface create`の詳細を確認してください。

+
次の例では、ブロードキャスト ドメイン `ipspace-IC1-bd`にクラスタ間 LIF `cluster01_icl01`と `cluster01_icl02`を作成します：

+
[listing]
----
cluster01::> network interface create -vserver ipspace-IC1 -lif cluster01_icl01 -service-
policy default-intercluster -home-node cluster01-01 -home-port e0e -address 192.168.1.201
-netmask 255.255.255.0

cluster01::> network interface create -vserver ipspace-IC1 -lif cluster01_icl02 -service-
policy default-intercluster -home-node cluster01-02 -home-port e0e -address 192.168.1.202
-netmask 255.255.255.0
----
. クラスタ間LIFが作成されたことを確認します。
+
|===
| オプション | 概要 


 a| 
*ONTAP 9.6以降：*
 a| 
`network interface show -service-policy default-intercluster`



 a| 
*ONTAP 9.5以前の場合：*
 a| 
`network interface show -role intercluster`

|===
+
 `network interface show`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-interface-show.html["ONTAPコマンド リファレンス"^]を参照してください。

+
[listing]
----
cluster01::> network interface show -service-policy default-intercluster
            Logical    Status     Network            Current       Current Is
Vserver     Interface  Admin/Oper Address/Mask       Node          Port    Home
----------- ---------- ---------- ------------------ ------------- ------- ----
ipspace-IC1
            cluster01_icl01
                       up/up      192.168.1.201/24   cluster01-01  e0e     true
            cluster01_icl02
                       up/up      192.168.1.202/24   cluster01-02  e0f     true
----
. クラスタ間LIFが冗長構成になっていることを確認します。
+
|===
| オプション | 概要 


 a| 
*ONTAP 9.6以降：*
 a| 
`network interface show -service-policy default-intercluster -failover`



 a| 
*ONTAP 9.5以前の場合：*
 a| 
`network interface show -role intercluster -failover`

|===
+
 `network interface show`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/network-interface-show.html["ONTAPコマンド リファレンス"^]を参照してください。

+
次の例は、SVM `e0e`上のクラスタ間LIF `cluster01_icl01`と `cluster01_icl02`が`e0f`ポートにフェイルオーバーすることを示しています：

+
[listing]
----
cluster01::> network interface show -service-policy default-intercluster –failover
         Logical         Home                  Failover        Failover
Vserver  Interface       Node:Port             Policy          Group
-------- --------------- --------------------- --------------- --------
ipspace-IC1
         cluster01_icl01 cluster01-01:e0e   local-only      intercluster01
                            Failover Targets:  cluster01-01:e0e,
                                               cluster01-01:e0f
         cluster01_icl02 cluster01-02:e0e   local-only      intercluster01
                            Failover Targets:  cluster01-02:e0e,
                                               cluster01-02:e0f
----

