---
permalink: peering/configure-intercluster-lifs-use-dedicated-ports-task.html 
sidebar: sidebar 
keywords: configure, intercluster, lifs, dedicated, ports 
summary: 専用ポートにクラスタ間 LIF を設定できます。通常は、レプリケーショントラフィックに使用できる帯域幅が増加します。 
---
= 専用ポートにクラスタ間 LIF を設定します
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
専用ポートにクラスタ間 LIF を設定できます。通常は、レプリケーショントラフィックに使用できる帯域幅が増加します。

.手順
. クラスタ内のポートの一覧を表示します。
+
`network port show`

+
コマンド構文全体については、マニュアルページを参照してください。

+
次の例は、のネットワークポートを示しています `cluster01`：

+
[listing]
----

cluster01::> network port show
                                                             Speed (Mbps)
Node   Port      IPspace      Broadcast Domain Link   MTU    Admin/Oper
------ --------- ------------ ---------------- ----- ------- ------------
cluster01-01
       e0a       Cluster      Cluster          up     1500   auto/1000
       e0b       Cluster      Cluster          up     1500   auto/1000
       e0c       Default      Default          up     1500   auto/1000
       e0d       Default      Default          up     1500   auto/1000
       e0e       Default      Default          up     1500   auto/1000
       e0f       Default      Default          up     1500   auto/1000
cluster01-02
       e0a       Cluster      Cluster          up     1500   auto/1000
       e0b       Cluster      Cluster          up     1500   auto/1000
       e0c       Default      Default          up     1500   auto/1000
       e0d       Default      Default          up     1500   auto/1000
       e0e       Default      Default          up     1500   auto/1000
       e0f       Default      Default          up     1500   auto/1000
----
. クラスタ間通信専用に使用可能なポートを特定します。
+
`network interface show -fields home-port,curr-port`

+
コマンド構文全体については、マニュアルページを参照してください。

+
次の例は、そのポートを示しています `e0e` および `e0f` LIFが割り当てられていない場合：

+
[listing]
----

cluster01::> network interface show -fields home-port,curr-port
vserver lif                  home-port curr-port
------- -------------------- --------- ---------
Cluster cluster01-01_clus1   e0a       e0a
Cluster cluster01-01_clus2   e0b       e0b
Cluster cluster01-02_clus1   e0a       e0a
Cluster cluster01-02_clus2   e0b       e0b
cluster01
        cluster_mgmt         e0c       e0c
cluster01
        cluster01-01_mgmt1   e0c       e0c
cluster01
        cluster01-02_mgmt1   e0c       e0c
----
. 専用ポートのフェイルオーバーグループを作成します。
+
`network interface failover-groups create -vserver _system_SVM_ -failover-group _failover_group_ -targets _physical _or_logical_ports_`

+
次に、ポートを割り当てる例を示します `e0e` および `e0f` フェイルオーバーグループに追加します `intercluster01` システムSVM `cluster01`：

+
[listing]
----
cluster01::> network interface failover-groups create -vserver cluster01 -failover-group
intercluster01 -targets
cluster01-01:e0e,cluster01-01:e0f,cluster01-02:e0e,cluster01-02:e0f
----
. フェイルオーバーグループが作成されたことを確認します。
+
`network interface failover-groups show`

+
コマンド構文全体については、マニュアルページを参照してください。

+
[listing]
----
cluster01::> network interface failover-groups show
                                  Failover
Vserver          Group            Targets
---------------- ---------------- --------------------------------------------
Cluster
                 Cluster
                                  cluster01-01:e0a, cluster01-01:e0b,
                                  cluster01-02:e0a, cluster01-02:e0b
cluster01
                 Default
                                  cluster01-01:e0c, cluster01-01:e0d,
                                  cluster01-02:e0c, cluster01-02:e0d,
                                  cluster01-01:e0e, cluster01-01:e0f
                                  cluster01-02:e0e, cluster01-02:e0f
                 intercluster01
                                  cluster01-01:e0e, cluster01-01:e0f
                                  cluster01-02:e0e, cluster01-02:e0f
----
. システム SVM にクラスタ間 LIF を作成して、フェイルオーバーグループに割り当てます。
+
|===
| オプション | 説明 


 a| 
* ONTAP 9.6 以降： *
 a| 
`network interface create -vserver _system_SVM_ -lif _LIF_name_ -service-policy default-intercluster -home-node _node_ -home- port _port_ -address _port_IP_ -netmask _netmask_ -failover-group _failover_group_`



 a| 
* ONTAP 9.5 以前： *
 a| 
`network interface create -vserver _system_SVM_ -lif _LIF_name_ -role intercluster -home-node _node_ -home-port _port_ -address _port_IP_ -netmask _netmask_ -failover-group _failover_group_`

|===
+
コマンド構文全体については、マニュアルページを参照してください。

+
次の例は、クラスタ間LIFを作成します `cluster01_icl01` および `cluster01_icl02` フェイルオーバーグループ `intercluster01`：

+
[listing]
----
cluster01::> network interface create -vserver cluster01 -lif cluster01_icl01 -service-
policy default-intercluster -home-node cluster01-01 -home-port e0e -address 192.168.1.201
-netmask 255.255.255.0 -failover-group intercluster01

cluster01::> network interface create -vserver cluster01 -lif cluster01_icl02 -service-
policy default-intercluster -home-node cluster01-02 -home-port e0e -address 192.168.1.202
-netmask 255.255.255.0 -failover-group intercluster01
----
. クラスタ間 LIF が作成されたことを確認します。
+
|===
| オプション | 説明 


 a| 
* ONTAP 9.6 以降： *
 a| 
`network interface show -service-policy default-intercluster`



 a| 
* ONTAP 9.5 以前： *
 a| 
`network interface show -role intercluster`

|===
+
コマンド構文全体については、マニュアルページを参照してください。

+
[listing]
----
cluster01::> network interface show -service-policy default-intercluster
            Logical    Status     Network            Current       Current Is
Vserver     Interface  Admin/Oper Address/Mask       Node          Port    Home
----------- ---------- ---------- ------------------ ------------- ------- ----
cluster01
            cluster01_icl01
                       up/up      192.168.1.201/24   cluster01-01  e0e     true
            cluster01_icl02
                       up/up      192.168.1.202/24   cluster01-02  e0f     true
----
. クラスタ間 LIF が冗長構成になっていることを確認します。
+
|===
| オプション | 説明 


 a| 
* ONTAP 9.6 以降： *
 a| 
`network interface show -service-policy default-intercluster -failover`



 a| 
* ONTAP 9.5 以前： *
 a| 
`network interface show -role intercluster -failover`

|===
+
コマンド構文全体については、マニュアルページを参照してください。

+
次の例は、クラスタ間LIFを示しています `cluster01_icl01` および `cluster01_icl02` 指定します``e0e`` ポートはにフェイルオーバーされます `e0f` ポート：

+
[listing]
----
cluster01::> network interface show -service-policy default-intercluster –failover
         Logical         Home                  Failover        Failover
Vserver  Interface       Node:Port             Policy          Group
-------- --------------- --------------------- --------------- --------
cluster01
         cluster01_icl01 cluster01-01:e0e   local-only      intercluster01
                            Failover Targets:  cluster01-01:e0e,
                                               cluster01-01:e0f
         cluster01_icl02 cluster01-02:e0e   local-only      intercluster01
                            Failover Targets:  cluster01-02:e0e,
                                               cluster01-02:e0f
----

