---
permalink: peering/configure-intercluster-lifs-use-ports-own-networks-task.html 
sidebar: sidebar 
keywords: configure, intercluster, LIFs  custom, ipspaces 
summary: カスタム IPspace にクラスタ間 LIF を設定できます。これにより、マルチテナント環境でレプリケーショントラフィックを分離できます。 
---
= カスタムIPspaceでのONTAPクラスタ間LIFの設定
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
カスタム IPspace にクラスタ間 LIF を設定できます。これにより、マルチテナント環境でレプリケーショントラフィックを分離できます。

カスタム IPspace を作成すると、その IPspace 内のシステムオブジェクトのコンテナとして機能するシステム Storage Virtual Machine （ SVM ）が作成されます。この SVM は、作成した IPspace 内のすべてのクラスタ間 LIF のコンテナとして使用できます。新しい SVM の名前がカスタム IPspace と同じです。

.手順
. クラスタ内のポートの一覧を表示します。
+
`network port show`

+
の詳細については `network port show`、をlink:https://docs.netapp.com/us-en/ontap-cli/network-port-show.html["ONTAPコマンド リファレンス"^]参照してください。

+
次の例は、のネットワークポートを示してい `cluster01`ます。

+
[listing]
----

cluster01::> network port show
                                                             Speed (Mbps)
Node   Port      IPspace      Broadcast Domain Link   MTU    Admin/Oper
------ --------- ------------ ---------------- ----- ------- ------------
cluster01-01
       e0a       Cluster      Cluster          up     1500   auto/1000
       e0b       Cluster      Cluster          up     1500   auto/1000
       e0c       Default      Default          up     1500   auto/1000
       e0d       Default      Default          up     1500   auto/1000
       e0e       Default      Default          up     1500   auto/1000
       e0f       Default      Default          up     1500   auto/1000
cluster01-02
       e0a       Cluster      Cluster          up     1500   auto/1000
       e0b       Cluster      Cluster          up     1500   auto/1000
       e0c       Default      Default          up     1500   auto/1000
       e0d       Default      Default          up     1500   auto/1000
       e0e       Default      Default          up     1500   auto/1000
       e0f       Default      Default          up     1500   auto/1000
----
. クラスタにカスタム IPspace を作成します。
+
`network ipspace create -ipspace _ipspace_`

+
次の例は、カスタムIPspaceを作成し `ipspace-IC1`ます。

+
[listing]
----
cluster01::> network ipspace create -ipspace ipspace-IC1
----
. クラスタ間通信専用に使用できるポートを特定します。
+
`network interface show -fields home-port,curr-port`

+
の詳細については `network interface show`、をlink:https://docs.netapp.com/us-en/ontap-cli/network-interface-show.html["ONTAPコマンド リファレンス"^]参照してください。

+
次の例は、ポートと `e0f`にLIFが割り当てられていないことを示してい `e0e`ます。

+
[listing]
----

cluster01::> network interface show -fields home-port,curr-port
vserver lif                  home-port curr-port
------- -------------------- --------- ---------
Cluster cluster01_clus1   e0a       e0a
Cluster cluster01_clus2   e0b       e0b
Cluster cluster02_clus1   e0a       e0a
Cluster cluster02_clus2   e0b       e0b
cluster01
        cluster_mgmt         e0c       e0c
cluster01
        cluster01-01_mgmt1   e0c       e0c
cluster01
        cluster01-02_mgmt1   e0c       e0c
----
. デフォルトのブロードキャストドメインから使用可能なポートを削除します。
+
`network port broadcast-domain remove-ports -broadcast-domain Default -ports ports`

+
一度に複数のブロードキャストドメインにポートを配置することはできません。の詳細については `network port broadcast-domain remove-ports`、をlink:https://docs.netapp.com/us-en/ontap-cli/network-port-broadcast-domain-remove-ports.html["ONTAPコマンド リファレンス"^]参照してください。

+
次の例は、デフォルトのブロードキャストドメインからポートとを `e0f`削除し `e0e`ます。

+
[listing]
----
cluster01::> network port broadcast-domain remove-ports -broadcast-domain Default -ports
cluster01-01:e0e,cluster01-01:e0f,cluster01-02:e0e,cluster01-02:e0f
----
. デフォルトのブロードキャストドメインからポートが削除されたことを確認します。
+
`network port show`

+
の詳細については `network port show`、をlink:https://docs.netapp.com/us-en/ontap-cli/network-port-show.html["ONTAPコマンド リファレンス"^]参照してください。

+
次の例は、ポートとが `e0f`デフォルトのブロードキャストドメインから削除されたことを示してい `e0e`ます。

+
[listing]
----
cluster01::> network port show
                                                       Speed (Mbps)
Node   Port    IPspace   Broadcast Domain Link   MTU    Admin/Oper
------ ------- --------- --------------- ----- ------- ------------
cluster01-01
       e0a     Cluster    Cluster          up    9000  auto/1000
       e0b     Cluster    Cluster          up    9000  auto/1000
       e0c     Default    Default          up    1500  auto/1000
       e0d     Default    Default          up    1500  auto/1000
       e0e     Default    -                up    1500  auto/1000
       e0f     Default    -                up    1500  auto/1000
       e0g     Default    Default          up    1500  auto/1000
cluster01-02
       e0a     Cluster    Cluster          up    9000  auto/1000
       e0b     Cluster    Cluster          up    9000  auto/1000
       e0c     Default    Default          up    1500  auto/1000
       e0d     Default    Default          up    1500  auto/1000
       e0e     Default    -                up    1500  auto/1000
       e0f     Default    -                up    1500  auto/1000
       e0g     Default    Default          up    1500  auto/1000
----
. カスタム IPspace にブロードキャストドメインを作成します。
+
`network port broadcast-domain create -ipspace _ipspace_ -broadcast-domain _broadcast_domain_ -mtu _MTU_ -ports _ports_`

+
次の例は、IPspaceに `ipspace-IC1`ブロードキャストドメインを作成し `ipspace-IC1-bd`ます。

+
[listing]
----
cluster01::> network port broadcast-domain create -ipspace ipspace-IC1 -broadcast-domain
ipspace-IC1-bd -mtu 1500 -ports cluster01-01:e0e,cluster01-01:e0f,
cluster01-02:e0e,cluster01-02:e0f
----
. ブロードキャストドメインが作成されたことを確認します。
+
`network port broadcast-domain show`

+
の詳細については `network port broadcast-domain show`、をlink:https://docs.netapp.com/us-en/ontap-cli/network-port-broadcast-domain-show.html["ONTAPコマンド リファレンス"^]参照してください。

+
[listing]
----
cluster01::> network port broadcast-domain show
IPspace Broadcast                                         Update
Name    Domain Name    MTU  Port List                     Status Details
------- ----------- ------  ----------------------------- --------------
Cluster Cluster       9000
                            cluster01-01:e0a              complete
                            cluster01-01:e0b              complete
                            cluster01-02:e0a              complete
                            cluster01-02:e0b              complete
Default Default       1500
                            cluster01-01:e0c              complete
                            cluster01-01:e0d              complete
                            cluster01-01:e0f              complete
                            cluster01-01:e0g              complete
                            cluster01-02:e0c              complete
                            cluster01-02:e0d              complete
                            cluster01-02:e0f              complete
                            cluster01-02:e0g              complete
ipspace-IC1
        ipspace-IC1-bd
                      1500
                            cluster01-01:e0e              complete
                            cluster01-01:e0f              complete
                            cluster01-02:e0e              complete
                            cluster01-02:e0f              complete
----
. システム SVM にクラスタ間 LIF を作成して、ブロードキャストドメインに割り当てます。
+
|===
| オプション | 説明 


 a| 
* ONTAP 9.6 以降： *
 a| 
`network interface create -vserver _system_SVM_ -lif _LIF_name_ -service-policy default-intercluster -home-node _node_ -home-port _port_ -address _port_IP_ -netmask _netmask_`



 a| 
* ONTAP 9.5 以前： *
 a| 
`network interface create -vserver _system_SVM_ -lif _LIF_name_ -role intercluster -home-node _node_ -home-port _port_ -address _port_IP_ -netmask _netmask_`

|===
+
LIF は、ホームポートが割り当てられているブロードキャストドメインに作成されます。ブロードキャストドメインには、そのドメインと同じ名前のデフォルトのフェイルオーバーグループがあります。の詳細については `network interface create`、をlink:https://docs.netapp.com/us-en/ontap-cli/network-interface-create.html["ONTAPコマンド リファレンス"^]参照してください。

+
次の例は、ブロードキャストドメインに `ipspace-IC1-bd`クラスタ間LIFと `cluster01_icl02`を作成し `cluster01_icl01`ます。

+
[listing]
----
cluster01::> network interface create -vserver ipspace-IC1 -lif cluster01_icl01 -service-
policy default-intercluster -home-node cluster01-01 -home-port e0e -address 192.168.1.201
-netmask 255.255.255.0

cluster01::> network interface create -vserver ipspace-IC1 -lif cluster01_icl02 -service-
policy default-intercluster -home-node cluster01-02 -home-port e0e -address 192.168.1.202
-netmask 255.255.255.0
----
. クラスタ間LIFが作成されたことを確認します。
+
|===
| オプション | 説明 


 a| 
* ONTAP 9.6 以降： *
 a| 
`network interface show -service-policy default-intercluster`



 a| 
* ONTAP 9.5 以前： *
 a| 
`network interface show -role intercluster`

|===
+
の詳細については `network interface show`、をlink:https://docs.netapp.com/us-en/ontap-cli/network-interface-show.html["ONTAPコマンド リファレンス"^]参照してください。

+
[listing]
----
cluster01::> network interface show -service-policy default-intercluster
            Logical    Status     Network            Current       Current Is
Vserver     Interface  Admin/Oper Address/Mask       Node          Port    Home
----------- ---------- ---------- ------------------ ------------- ------- ----
ipspace-IC1
            cluster01_icl01
                       up/up      192.168.1.201/24   cluster01-01  e0e     true
            cluster01_icl02
                       up/up      192.168.1.202/24   cluster01-02  e0f     true
----
. クラスタ間LIFが冗長構成になっていることを確認します。
+
|===
| オプション | 説明 


 a| 
* ONTAP 9.6 以降： *
 a| 
`network interface show -service-policy default-intercluster -failover`



 a| 
* ONTAP 9.5 以前： *
 a| 
`network interface show -role intercluster -failover`

|===
+
の詳細については `network interface show`、をlink:https://docs.netapp.com/us-en/ontap-cli/network-interface-show.html["ONTAPコマンド リファレンス"^]参照してください。

+
次の例は、クラスタ間LIFと `cluster01_icl02`SVMポート上の `e0e`ポートが「e0f」ポートにフェイルオーバーすることを示しています `cluster01_icl01`。

+
[listing]
----
cluster01::> network interface show -service-policy default-intercluster –failover
         Logical         Home                  Failover        Failover
Vserver  Interface       Node:Port             Policy          Group
-------- --------------- --------------------- --------------- --------
ipspace-IC1
         cluster01_icl01 cluster01-01:e0e   local-only      intercluster01
                            Failover Targets:  cluster01-01:e0e,
                                               cluster01-01:e0f
         cluster01_icl02 cluster01-02:e0e   local-only      intercluster01
                            Failover Targets:  cluster01-02:e0e,
                                               cluster01-02:e0f
----

