---
permalink: flexgroup/shrink-flexgroup-volume-task.html 
sidebar: sidebar 
keywords: reduce, size, flexgroup, volume, flex group, resize, shrink, shrinking, autosize 
summary: ONTAP 9 .6以降では、FlexGroupボリュームのサイズを現在のサイズよりも小さい値に変更して、ボリュームから未使用スペースを解放できます。FlexGroupボリュームのサイズを縮小すると、すべてのFlexGroupコンスティチュエントのサイズがONTAPによって自動的に変更されます。 
---
= ONTAP FlexGroupボリュームのサイズを縮小する
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
ONTAP 9 .6以降では、FlexGroupボリュームのサイズを現在のサイズよりも小さい値に変更して、ボリュームから未使用スペースを解放できます。FlexGroupボリュームのサイズを縮小すると、すべてのFlexGroupコンスティチュエントのサイズがONTAPによって自動的に変更されます。

.ステップ
. 現在のFlexGroup ボリュームサイズを確認します。「volume size -vserver _vserver_name _-volume_fg_name _」
. FlexGroupボリュームのサイズを縮小します。 `volume size -vserver _vserver_name_ -volume _fg_name_ _new_size_`
+
新しいサイズを指定するときは、現在のサイズよりも小さい値を指定するか、マイナス記号（-）を使用してFlexGroupボリュームの現在のサイズが縮小される負の値を指定できます。

+
[NOTE]
====
volumeコマンドに対して自動縮小が有効になっている場合(`volume autosize`）、最小オートサイズはボリュームの新しいサイズに設定されます。

====
+
次の例は、volXという名前のFlexGroupボリュームの現在のボリュームサイズを表示し、ボリュームのサイズを10TBに変更します。

+
[listing]
----
cluster1::> volume size -vserver svm1 -volume volX
(volume size)
vol size: FlexGroup volume 'svm1:volX' has size 15TB.

cluster1::> volume size -vserver svm1 -volume volX 10TB
(volume size)
vol size: FlexGroup volume 'svm1:volX' size set to 10TB.
----
+
次の例は、volXという名前のFlexGroupボリュームの現在のボリュームサイズを表示し、ボリュームのサイズを5TBだけ縮小します。

+
[listing]
----
cluster1::> volume size -vserver svm1 -volume volX
(volume size)
vol size: FlexGroup volume 'svm1:volX' has size 15TB.

cluster1::> volume size -vserver svm1 -volume volX -5TB
(volume size)
vol size: FlexGroup volume 'svm1:volX' size set to 10TB.
----

