---
sidebar: sidebar 
permalink: networking/configure_lif_service_policies.html 
keywords: create service policy, assign service policy, service policy commands, configure lif service policies, create and assign a service policy for lifs, configure lif service policies, create a service policy for lifs, network interface service show, service-policy create, assign a service policy to a lif, examples, commands for managing lif service policies 
summary: LIFのサービスポリシーを作成して割り当てる 
---
= ONTAPクラスタのLIFサービスポリシーを設定する
:hardbreaks:
:allow-uri-read: 
:nofooter: 
:icons: font
:linkattrs: 
:imagesdir: ../media/


[role="lead"]
LIFのサービス ポリシーを設定して、LIFを使用する単一のサービスまたは一連のサービスを指定することができます。



== LIFのサービス ポリシーの作成

LIFのサービス ポリシーを作成することができます。1つ以上のLIFにサービス ポリシーを割り当てることで、1つまたは一連のサービスのトラフィックの処理をLIFに許可することができます。

 `network interface service-policy create`コマンドを実行するには高度な権限が必要です。

.タスク概要
データSVMとシステムSVM両方のデータ トラフィックと管理トラフィックの管理に、組み込みのサービスおよびサービス ポリシーを使用できます。ほとんどのユースケースでは、カスタム サービス ポリシーを作成するのではなく、組み込みのサービス ポリシーを使用して対応できます。

これらの組み込みのサービス ポリシーは必要に応じて変更できます。

.手順
. クラスタで使用できるサービスを確認します。
+
....
network interface service show
....
+
サービスとは、LIFがアクセスするアプリケーション、およびクラスタで提供されるアプリケーションです。各サービスには、アプリケーションがリスンしているTCPポートとUDPポートが0個以上含まれています。

+
次の追加のデータ サービスと管理サービスを使用できます。

+
....
cluster1::> network interface service show

Service                     Protocol:Ports
-------                     --------------
cluster-core                -
data-cifs                   -
data-core                   -
data-flexcache              -
data-iscsi                  -
data-nfs                    -
intercluster-core           tcp:11104-11105
management-autosupport      -
management-bgp              tcp:179
management-core             -
management-https            tcp:443
management-ssh              tcp:22
12 entries were displayed.
....
. クラスタに存在するサービス ポリシーを確認します。
+
....
cluster1::> network interface service-policy show

Vserver   Policy                     Service: Allowed Addresses
--------- -------------------------- ----------------------------------------
cluster1
          default-intercluster       intercluster-core: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-management         management-core: 0.0.0.0/0
                                     management-autosupport: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-route-announce     management-bgp: 0.0.0.0/0

Cluster
          default-cluster            cluster-core: 0.0.0.0/0

vs0
          default-data-blocks        data-core: 0.0.0.0/0
                                     data-iscsi: 0.0.0.0/0

          default-data-files         data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0
                                     data-flexcache: 0.0.0.0/0

          default-management         data-core: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

7 entries were displayed.
....
. サービス ポリシーを作成します。
+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver <svm_name> -policy <service_policy_name> -services <service_name> -allowed-addresses <IP_address/mask,...>
....
+
** 「service_name」には、ポリシーに含めるサービスのリストを指定します。
** 「IP_address/mask」には、サービス ポリシー内のサービスへのアクセスを許可するアドレスを、サブネット マスクのリストで指定します。デフォルトでは、指定したすべてのサービスが、デフォルトの許可アドレス リスト0.0.0.0/0（すべてのサブネットからのトラフィックを許可）で追加されます。デフォルト以外の許可アドレス リストを指定した場合、そのポリシーを使用するLIFは、指定したマスクと一致しないソース アドレスからの要求をすべてブロックするように設定されます。
+
次の例は、_NFS_ および _SMB_ サービスを含む SVM のデータ サービス ポリシー _svm1_data_policy_ を作成する方法を示しています：

+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver svm1 -policy svm1_data_policy -services data-nfs,data-cifs,data-core
....
+
次の例は、クラスタ間サービス ポリシーを作成する方法を示しています。

+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver cluster1 -policy intercluster1 -services intercluster-core
....


. サービス ポリシーが作成されたことを確認します。
+
....
cluster1::> network interface service-policy show
....
+
次の出力は、使用可能なサービス ポリシーを示しています。

+
....
cluster1::> network interface service-policy show

Vserver   Policy                     Service: Allowed Addresses
--------- -------------------------- ----------------------------------------
cluster1
          default-intercluster       intercluster-core: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          intercluster1              intercluster-core: 0.0.0.0/0

          default-management         management-core: 0.0.0.0/0
                                     management-autosupport: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-route-announce     management-bgp: 0.0.0.0/0

Cluster
          default-cluster            cluster-core: 0.0.0.0/0

vs0
          default-data-blocks        data-core: 0.0.0.0/0
                                     data-iscsi: 0.0.0.0/0

          default-data-files         data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0
                                     data-flexcache: 0.0.0.0/0

          default-management         data-core: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          svm1_data_policy           data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0

9 entries were displayed.
....


.終了後の操作
LIFの作成時または既存のLIFの変更時にサービス ポリシーを割り当てます。



== LIFへのサービス ポリシーの割り当て

LIFの作成時または変更時に、LIFにサービス ポリシーを割り当てることができます。サービス ポリシーは、LIFで使用できる一連のサービスを定義します。

.タスク概要
管理SVMとデータSVMのLIFにサービス ポリシーを割り当てることができます。

.手順
LIFにサービス ポリシーをいつ割り当てるかに応じて、次のいずれかのコマンドを実行します。

[cols="25,75"]
|===
| 状況 | サービスポリシーを割り当てます... 


| NVMe LIFの設定 | network interface create -vserver svm_name -lif <lif_name> -home-node <node_name> -home-port <port_name> {(-address <IP_address> -netmask <IP_address>) -subnet-name <subnet_name>} -service-policy <service_policy_name> 


| LIFの変更 | network interface modify -vserver <svm_name> -lif <lif_name> -service-policy <service_policy_name> 
|===
LIFのサービス ポリシーを指定する際に、LIFのデータ プロトコルとロールを指定する必要はありません。ロールとデータ プロトコルを指定してLIFを作成することも可能です。


NOTE: サービス ポリシーは、サービス ポリシーの作成時に指定した同じSVMに含まれるLIFでのみ使用できます。



=== 例

次の例は、LIFのサービス ポリシーをdefault-managementに変更する方法を示しています。

....
cluster1::> network interface modify -vserver cluster1 -lif lif1 -service-policy default-management
....


== LIFのサービス ポリシーを管理するためのコマンド

 `network interface service-policy`コマンドを使用して、LIFサービスポリシーを管理します。

 `network interface service-policy`の詳細については、link:https://docs.netapp.com/us-en/ontap-cli/search.html?q=network+interface+service-policy["ONTAPコマンド リファレンス"^]をご覧ください。

.開始する前に
アクティブなSnapMirror関係にあるLIFのサービスポリシーを変更すると、レプリケーションスケジュールが中断されます。LIFをインタークラスタから非インタークラスタ（またはその逆）に変換した場合、それらの変更はピアクラスタにレプリケートされません。LIFのサービスポリシーを変更した後にピアクラスタを更新するには、まず `snapmirror abort`操作を実行してからxref:../data-protection/resynchronize-relationship-task.html[レプリケーション関係を再同期する]を実行してください。

|===
| 状況 | 使用するコマンド 


 a| 
サービスポリシーを作成する（高度な権限が必要）
 a| 
`network interface service-policy create`



 a| 
既存のサービスポリシーにサービスエントリを追加します（高度な権限が必要です）
 a| 
`network interface service-policy add-service`



 a| 
既存のサービスポリシーを複製する（高度な権限が必要）
 a| 
`network interface service-policy clone`



 a| 
既存のサービス ポリシー内のサービス エントリを変更する（高度な権限が必要）
 a| 
`network interface service-policy modify-service`



 a| 
既存のサービスポリシーからサービスエントリを削除します（高度な権限が必要です）
 a| 
`network interface service-policy remove-service`



 a| 
既存のサービスポリシーの名前を変更する（高度な権限が必要）
 a| 
`network interface service-policy rename`



 a| 
既存のサービスポリシーを削除します（高度な権限が必要です）
 a| 
`network interface service-policy delete`



 a| 
組み込みのサービスポリシーを元の状態に復元します（高度な権限が必要）
 a| 
`network interface service-policy restore-defaults`



 a| 
既存のサービス ポリシーを表示する
 a| 
`network interface service-policy show`

|===
.関連情報
* link:https://docs.netapp.com/us-en/ontap-cli/network-interface-service-show.html["ネットワークインターフェイスサービスの表示"^]
* link:https://docs.netapp.com/us-en/ontap-cli/search.html?q=network+interface+service-policy["ネットワークインターフェイス サービスポリシー"^]
* link:https://docs.netapp.com/us-en/ontap-cli/snapmirror-abort.html["snapmirror abort"^]

