---
sidebar: sidebar 
permalink: networking/configure_lif_service_policies.html 
keywords: create service policy, assign service policy, service policy commands, configure lif service policies, create and assign a service policy for lifs, configure lif service policies, create a service policy for lifs, network interface service show, service-policy create, assign a service policy to a lif, examples, commands for managing lif service policies 
summary: LIF のサービスポリシーを作成して割り当てます 
---
= ONTAPクラスタのLIFサービスポリシーを設定する
:hardbreaks:
:allow-uri-read: 
:nofooter: 
:icons: font
:linkattrs: 
:imagesdir: ../media/


[role="lead"]
LIFのサービスポリシーを設定して、LIFを使用する単一のサービスまたは一連のサービスを指定できます。



== LIFのサービスポリシーを作成します。

LIFのサービスポリシーを作成できます。1つ以上のLIFにサービスポリシーを割り当てることで、1つまたは一連のサービスのトラフィックをLIFで伝送できるようにすることができます。

このコマンドを実行するには、高度なPrivilegesが必要です `network interface service-policy create`。

.タスクの内容
データSVMとシステムSVMの両方のデータトラフィックと管理トラフィックの管理に組み込みのサービスとサービスポリシーを使用できます。ほとんどのユースケースでは、カスタムサービスポリシーを作成するのではなく、組み込みのサービスポリシーを使用して問題を解決できます。

これらの組み込みのサービスポリシーは、必要に応じて変更できます。

.手順
. クラスタで使用可能なサービスを表示します。
+
....
network interface service show
....
+
サービスとは、LIFがアクセスするアプリケーションと、クラスタが提供するアプリケーションのことです。各サービスには、アプリケーションがリスンしているTCPおよびUDPポートが0個以上含まれています。

+
次の追加データサービスと管理サービスを使用できます。

+
....
cluster1::> network interface service show

Service                     Protocol:Ports
-------                     --------------
cluster-core                -
data-cifs                   -
data-core                   -
data-flexcache              -
data-iscsi                  -
data-nfs                    -
intercluster-core           tcp:11104-11105
management-autosupport      -
management-bgp              tcp:179
management-core             -
management-https            tcp:443
management-ssh              tcp:22
12 entries were displayed.
....
. クラスタ内のサービスポリシーを表示します。
+
....
cluster1::> network interface service-policy show

Vserver   Policy                     Service: Allowed Addresses
--------- -------------------------- ----------------------------------------
cluster1
          default-intercluster       intercluster-core: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-management         management-core: 0.0.0.0/0
                                     management-autosupport: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-route-announce     management-bgp: 0.0.0.0/0

Cluster
          default-cluster            cluster-core: 0.0.0.0/0

vs0
          default-data-blocks        data-core: 0.0.0.0/0
                                     data-iscsi: 0.0.0.0/0

          default-data-files         data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0
                                     data-flexcache: 0.0.0.0/0

          default-management         data-core: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

7 entries were displayed.
....
. サービスポリシーを作成します。
+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver <svm_name> -policy <service_policy_name> -services <service_name> -allowed-addresses <IP_address/mask,...>
....
+
** 「service_name」には、ポリシーに含めるサービスのリストを指定します。
** 「ip_address/mask」には、サービスポリシー内のサービスへのアクセスを許可するアドレスのサブネットマスクのリストを指定します。デフォルトでは、指定されたすべてのサービスが、すべてのサブネットからのトラフィックを許可するデフォルトの許可アドレスリスト0.0.0.0/0で追加されます。デフォルト以外の許可アドレスリストを指定すると、ポリシーを使用するLIFは、指定したマスクのいずれにも一致しないソースアドレスからの要求をすべてブロックするように設定されます。
+
次の例は、_nfs_or_SMB_servicesを含むSVM用のデータサービスポリシーsvm1_data_policy__を作成する方法を示しています。

+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver svm1 -policy svm1_data_policy -services data-nfs,data-cifs,data-core
....
+
次の例は、クラスタ間サービスポリシーを作成する方法を示しています。

+
....
cluster1::> set -privilege advanced
Warning: These advanced commands are potentially dangerous; use them only when directed to do so by technical support.
Do you wish to continue? (y or n): y

cluster1::> network interface service-policy create -vserver cluster1 -policy intercluster1 -services intercluster-core
....


. サービスポリシーが作成されたことを確認します。
+
....
cluster1::> network interface service-policy show
....
+
次の出力は、使用可能なサービスポリシーを示しています。

+
....
cluster1::> network interface service-policy show

Vserver   Policy                     Service: Allowed Addresses
--------- -------------------------- ----------------------------------------
cluster1
          default-intercluster       intercluster-core: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          intercluster1              intercluster-core: 0.0.0.0/0

          default-management         management-core: 0.0.0.0/0
                                     management-autosupport: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          default-route-announce     management-bgp: 0.0.0.0/0

Cluster
          default-cluster            cluster-core: 0.0.0.0/0

vs0
          default-data-blocks        data-core: 0.0.0.0/0
                                     data-iscsi: 0.0.0.0/0

          default-data-files         data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0
                                     data-flexcache: 0.0.0.0/0

          default-management         data-core: 0.0.0.0/0
                                     management-ssh: 0.0.0.0/0
                                     management-https: 0.0.0.0/0

          svm1_data_policy           data-core: 0.0.0.0/0
                                     data-nfs: 0.0.0.0/0
                                     data-cifs: 0.0.0.0/0

9 entries were displayed.
....


.終了後
LIFの作成時または既存のLIFの変更時に、サービスポリシーを割り当てます。



== LIFへのサービスポリシーの割り当て

LIFへのサービスポリシーの割り当ては、LIFの作成時または変更時に実行できます。サービスポリシーは、LIFで使用できる一連のサービスを定義します。

.タスクの内容
管理SVMとデータSVMのLIFにサービスポリシーを割り当てることができます。

.ステップ
サービスポリシーをいつLIFに割り当てるかに応じて、次のいずれかの操作を実行します。

[cols="25,75"]
|===
| 状況 | サービスポリシーを割り当てています ... 


| LIFの作成 | network interface create -vserver SVM_name -lif <LIF_name> -home-node <node_name > -home-port <port_name> ｛ （ -address <IP_address> -netmask <IP_address> ） -subnet-name <subnet_name> ｝ -service-policy <service_policy_name> 


| LIFの変更 | network interface modify -vserver <svm_name> -lif <lif_name> -service -policy <service_policy_name> 
|===
LIFのサービスポリシーを指定する場合、LIFのデータプロトコルとロールを指定する必要はありません。ロールとデータプロトコルを指定してLIFを作成することもできます。


NOTE: サービスポリシーは、サービスポリシーの作成時に指定したものと同じSVM内のLIFでのみ使用できます。



=== 例

次の例は、LIFのサービスポリシーをdefault-managementに変更する方法を示しています。

....
cluster1::> network interface modify -vserver cluster1 -lif lif1 -service-policy default-management
....


== LIFのサービスポリシーの管理用コマンド

LIFのサービスポリシーを管理するには、コマンドを使用し `network interface service-policy`ます。

の詳細については `network interface service-policy`、をlink:https://docs.netapp.com/us-en/ontap-cli/search.html?q=network+interface+service-policy["ONTAPコマンド リファレンス"^]参照してください。

.開始する前に
アクティブなSnapMirror関係にあるLIFのサービスポリシーを変更すると、レプリケーションスケジュールが中断されます。LIFをクラスタ間から非クラスタ間（またはその逆）に変換した場合、変更はピアクラスタにレプリケートされません。LIFサービスポリシーの変更後にピアクラスタを更新するには、最初にこの処理を実行し `snapmirror abort`てxref:../data-protection/resynchronize-relationship-task.html[レプリケーション関係を再同期する]ください。

|===
| 状況 | 使用するコマンド 


 a| 
サービスポリシーを作成する（advanced権限が必要）
 a| 
`network interface service-policy create`



 a| 
既存のサービスポリシーにサービスエントリを追加する（advanced権限が必要）
 a| 
`network interface service-policy add-service`



 a| 
既存のサービスポリシーのクローンを作成する（advanced権限が必要）
 a| 
`network interface service-policy clone`



 a| 
既存のサービスポリシーのサービスエントリを変更する（advanced権限が必要）
 a| 
`network interface service-policy modify-service`



 a| 
既存のサービスポリシーからサービスエントリを削除する（advanced権限が必要）
 a| 
`network interface service-policy remove-service`



 a| 
既存のサービスポリシーの名前を変更する（advanced権限が必要）
 a| 
`network interface service-policy rename`



 a| 
既存のサービスポリシーを削除する（advanced権限が必要）
 a| 
`network interface service-policy delete`



 a| 
組み込みのサービスポリシーを元の状態にリストアする（advanced権限が必要）
 a| 
`network interface service-policy restore-defaults`



 a| 
既存のサービスポリシーを表示する
 a| 
`network interface service-policy show`

|===
.関連情報
* link:https://docs.netapp.com/us-en/ontap-cli/network-interface-service-show.html["network interface service showの略"^]
* link:https://docs.netapp.com/us-en/ontap-cli/search.html?q=network+interface+service-policy["network interface service-policy"^]
* link:https://docs.netapp.com/us-en/ontap-cli/snapmirror-abort.html["スナップミラーの中止"^]

