---
permalink: system-admin/manage-ip-addresses-access-sp-task.html 
sidebar: sidebar 
keywords: manage, ip, addresses, access, sp, ssh, connection, node, cluster 
summary: デフォルトでは、SPは任意のIPアドレスを持つ管理ホストからのSSH接続要求を受け入れます。指定したIPアドレスを持つ管理ホストからのSSH接続要求のみを受け入れるようにSPを設定できます。変更は、クラスタ内の任意のノードのSPへのSSHアクセスに適用されます。 
---
= ONTAPサービスプロセッサにアクセスするための管理ホストIPアドレスを追加します
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
デフォルトでは、SPは任意のIPアドレスを持つ管理ホストからのSSH接続要求を受け入れます。指定したIPアドレスを持つ管理ホストからのSSH接続要求のみを受け入れるようにSPを設定できます。変更は、クラスタ内の任意のノードのSPへのSSHアクセスに適用されます。

.手順
.  `system service-processor ssh add-allowed-addresses`コマンドと `-allowed-addresses`パラメータを使用して、指定したIPアドレスのみにSPアクセスを許可します。
+
**  `-allowed-addresses`パラメータの値は `address`/`netmask`の形式で指定する必要があり、複数の `address`/`netmask`ペアはコンマで区切る必要があります（例： `10.98.150.10/24, fd20:8b1e:b255:c09b::/64`）。
+
 `-allowed-addresses`パラメータを `0.0.0.0/0, ::/0`に設定すると、すべてのIPアドレスがSPにアクセスできるようになります（デフォルト）。

** 指定した IP アドレスのみに SP アクセスを制限してデフォルトを変更すると、ONTAP は、指定した IP アドレスで「`allow all`」デフォルト設定を置き換えるかどうかを確認するプロンプトを表示します(`0.0.0.0/0, ::/0`。
** この `system service-processor ssh show`コマンドは、SPにアクセスできるIPアドレスを表示します。


. 指定された IP アドレスから SP へのアクセスをブロックする場合は、 `-allowed-addresses`パラメータを指定した `system service-processor ssh remove-allowed-addresses`コマンドを使用します。
+
すべての IP アドレスから SP へのアクセスをブロックすると、どの管理ホストからも SP にアクセスできなくなります。



.SPにアクセスできるIPアドレスを管理する例
次の例は、SPへのSSHアクセスのデフォルト設定を示し、指定されたIPアドレスのみにSPアクセスを制限してデフォルトを変更し、指定されたIPアドレスをアクセスリストから削除してから、すべてのIPアドレスのSPアクセスを復元します：

[listing]
----
cluster1::> system service-processor ssh show
  Allowed Addresses: 0.0.0.0/0, ::/0

cluster1::> system service-processor ssh add-allowed-addresses -allowed-addresses 192.168.1.202/24, 192.168.10.201/24

Warning: The default "allow all" setting (0.0.0.0/0, ::/0) will be replaced
         with your changes. Do you want to continue? {y|n}: y

cluster1::> system service-processor ssh show
  Allowed Addresses: 192.168.1.202/24, 192.168.10.201/24

cluster1::> system service-processor ssh remove-allowed-addresses -allowed-addresses 192.168.1.202/24, 192.168.10.201/24

Warning: If all IP addresses are removed from the allowed address list, all IP
         addresses will be denied access. To restore the "allow all" default,
         use the "system service-processor ssh add-allowed-addresses
         -allowed-addresses 0.0.0.0/0, ::/0" command. Do you want to continue?
          {y|n}: y

cluster1::> system service-processor ssh show
  Allowed Addresses: -

cluster1::> system service-processor ssh add-allowed-addresses -allowed-addresses 0.0.0.0/0, ::/0

cluster1::> system service-processor ssh show
  Allowed Addresses: 0.0.0.0/0, ::/0
----