---
permalink: system-admin/manage-ip-addresses-access-sp-task.html 
sidebar: sidebar 
keywords: manage, ip, addresses, access, sp, ssh, connection, node, cluster 
summary: デフォルトでは、 SP はすべての IP アドレスの管理ホストからの SSH 接続要求を受け付けます。指定した IP アドレスを持つ管理ホストのみからの SSH 接続要求を受け付けるように SP を設定できます。変更内容は、クラスタ内のすべてのノードの SP への SSH アクセスに適用されます。 
---
= SPにアクセスできるIPアドレスを管理します。
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
デフォルトでは、 SP はすべての IP アドレスの管理ホストからの SSH 接続要求を受け付けます。指定した IP アドレスを持つ管理ホストのみからの SSH 接続要求を受け付けるように SP を設定できます。変更内容は、クラスタ内のすべてのノードの SP への SSH アクセスに適用されます。

.手順
. 指定したIPアドレスのみにSPアクセスを許可するには、 `system service-processor ssh add-allowed-addresses`コマンドでパラメータを指定 `-allowed-addresses`します。
+
** パラメータの値は `-allowed-addresses`の形式で指定する必要があります `address`/`netmask`。複数の `address`/`netmask`ペアはカンマで区切る必要があります（例：） `10.98.150.10/24, fd20:8b1e:b255:c09b::/64`。
+
パラメータをに `0.0.0.0/0, ::/0`設定する `-allowed-addresses`と、すべてのIPアドレスがSPにアクセスできるようになります（デフォルト）。

** 指定したIPアドレスのみにSPアクセスを制限してデフォルトを変更すると、ONTAPは、指定したIPアドレスで「すべて許可」のデフォルト設定を置き換えることを確認するプロンプトを表示し(`0.0.0.0/0, ::/0`ます）。
**  `system service-processor ssh show`コマンドは、SPにアクセスできるIPアドレスを表示します。


. 指定したIPアドレスによるSPへのアクセスをブロックするには、パラメータを指定してコマンドを `-allowed-addresses`使用し `system service-processor ssh remove-allowed-addresses`ます。
+
すべての IP アドレスから SP へのアクセスをブロックすると、管理ホストから SP にアクセスできなくなります。



.SPにアクセスできるIPアドレスの管理の例
次の例は、 SP への SSH アクセスのためのデフォルト設定を示しています。ここでは、指定した IP アドレスのみに SP アクセスを制限することで、デフォルトの設定を変更し、指定した IP アドレスをアクセスリストから削除し、すべての IP アドレスに対する SP アクセスをリストアします。

[listing]
----
cluster1::> system service-processor ssh show
  Allowed Addresses: 0.0.0.0/0, ::/0

cluster1::> system service-processor ssh add-allowed-addresses -allowed-addresses 192.168.1.202/24, 192.168.10.201/24

Warning: The default "allow all" setting (0.0.0.0/0, ::/0) will be replaced
         with your changes. Do you want to continue? {y|n}: y

cluster1::> system service-processor ssh show
  Allowed Addresses: 192.168.1.202/24, 192.168.10.201/24

cluster1::> system service-processor ssh remove-allowed-addresses -allowed-addresses 192.168.1.202/24, 192.168.10.201/24

Warning: If all IP addresses are removed from the allowed address list, all IP
         addresses will be denied access. To restore the "allow all" default,
         use the "system service-processor ssh add-allowed-addresses
         -allowed-addresses 0.0.0.0/0, ::/0" command. Do you want to continue?
          {y|n}: y

cluster1::> system service-processor ssh show
  Allowed Addresses: -

cluster1::> system service-processor ssh add-allowed-addresses -allowed-addresses 0.0.0.0/0, ::/0

cluster1::> system service-processor ssh show
  Allowed Addresses: 0.0.0.0/0, ::/0
----