---
permalink: system-admin/manage-ip-addresses-access-sp-task.html 
sidebar: sidebar 
keywords: manage, ip, addresses, access, sp, ssh, connection, node, cluster 
summary: デフォルトでは、 SP はすべての IP アドレスの管理ホストからの SSH 接続要求を受け付けます。指定した IP アドレスを持つ管理ホストのみからの SSH 接続要求を受け付けるように SP を設定できます。変更内容は、クラスタ内のすべてのノードの SP への SSH アクセスに適用されます。 
---
= SP にアクセスできる IP アドレスを管理します
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
デフォルトでは、 SP はすべての IP アドレスの管理ホストからの SSH 接続要求を受け付けます。指定した IP アドレスを持つ管理ホストのみからの SSH 接続要求を受け付けるように SP を設定できます。変更内容は、クラスタ内のすべてのノードの SP への SSH アクセスに適用されます。

.手順
. 指定したIPアドレスのみにSPアクセスを付与するには、を使用します `system service-processor ssh add-allowed-addresses` コマンドにを指定します `-allowed-addresses` パラメータ
+
** の値 `-allowed-addresses` パラメータはの形式で指定する必要があります `address`/`netmask`、および複数 `address`/`netmask` ペアはカンマで区切る必要があります。例： `10.98.150.10/24, fd20:8b1e:b255:c09b::/64`。
+
を設定します `-allowed-addresses` パラメータの値 `0.0.0.0/0, ::/0` すべてのIPアドレスがSPにアクセスできるようにします（デフォルト）。

** 指定したIPアドレスのみにSPアクセスを制限してデフォルトを変更すると、ONTAP は、指定したIPアドレスでデフォルト設定「すべて許可」を置き換えることを確認するプロンプトを表示します (`0.0.0.0/0, ::/0`）。
** 。 `system service-processor ssh show` コマンドは、SPにアクセスできるIPアドレスを表示します。


. 指定したIPアドレスをSPへのアクセスからブロックする場合は、を使用します `system service-processor ssh remove-allowed-addresses` コマンドにを指定します `-allowed-addresses` パラメータ
+
すべての IP アドレスから SP へのアクセスをブロックすると、管理ホストから SP にアクセスできなくなります。



.SPにアクセスできるIPアドレスの管理の例
次の例は、 SP への SSH アクセスのためのデフォルト設定を示しています。ここでは、指定した IP アドレスのみに SP アクセスを制限することで、デフォルトの設定を変更し、指定した IP アドレスをアクセスリストから削除し、すべての IP アドレスに対する SP アクセスをリストアします。

[listing]
----
cluster1::> system service-processor ssh show
  Allowed Addresses: 0.0.0.0/0, ::/0

cluster1::> system service-processor ssh add-allowed-addresses -allowed-addresses 192.168.1.202/24, 192.168.10.201/24

Warning: The default "allow all" setting (0.0.0.0/0, ::/0) will be replaced
         with your changes. Do you want to continue? {y|n}: y

cluster1::> system service-processor ssh show
  Allowed Addresses: 192.168.1.202/24, 192.168.10.201/24

cluster1::> system service-processor ssh remove-allowed-addresses -allowed-addresses 192.168.1.202/24, 192.168.10.201/24

Warning: If all IP addresses are removed from the allowed address list, all IP
         addresses will be denied access. To restore the "allow all" default,
         use the "system service-processor ssh add-allowed-addresses
         -allowed-addresses 0.0.0.0/0, ::/0" command. Do you want to continue?
          {y|n}: y

cluster1::> system service-processor ssh show
  Allowed Addresses: -

cluster1::> system service-processor ssh add-allowed-addresses -allowed-addresses 0.0.0.0/0, ::/0

cluster1::> system service-processor ssh show
  Allowed Addresses: 0.0.0.0/0, ::/0
----